tiborsimon/embedded-tdd-headers/pic/pic18/pic18f4680_tdd.h
#define HLVDL3                        4439
#define LVV3                          4440
#define LVDL3                         4441
#define HLVDEN                        4442
#define LVDEN                         4443
#define BGST                          4444
#define IRVST                         4445
#define IVRST                         4446
#define VDIRMAG                       4447
#define OSCCON                        4448
#define SCS0                          4449
#define SCS                           4450
#define SCS1                          4451
#define IOFS                          4452
#define OSTS                          4453
#define IRCF                          4454
#define IRCF0                         4455
#define IRCF1                         4456
#define IRCF2                         4457
#define IDLEN                         4458
#define T0CON                         4459
#define T0PS                          4460
#define T0PS0                         4461
#define T0PS1                         4462
#define T0PS2                         4463
#define PSA                           4464
#define T0PS3                         4465
#define T0SE                          4466
#define T0CS                          4467
#define T08BIT                        4468
#define TMR0ON                        4469
#define STATUS                        4470
#define C                             4471
#define CARRY                         4472
#define DC                            4473
#define ZERO                          4474
#define Z                             4475
#define OV                            4476
#define OVERFLOW                      4477
#define N                             4478
#define NEGATIVE                      4479
#define INTCON3                       4480
#define INT1IF                        4481
#define INT1F                         4482
#define INT2IF                        4483
#define INT2F                         4484
#define INT1E                         4485
#define INT1IE                        4486
#define INT2IE                        4487
#define INT2E                         4488
#define INT1P                         4489
#define INT1IP                        4490
#define INT2IP                        4491
#define INT2P                         4492
#define INTCON2                       4493
#define RBIP                          4494
#define TMR0IP                        4495
#define T0IP                          4496
#define INTEDG2                       4497
#define INTEDG1                       4498
#define INTEDG0                       4499
#define RBPU                          4500
#define NOT_RBPU                      4501
#define nRBPU                         4502
#define INTCON                        4503
#define RBIF                          4504
#define INT0F                         4505
#define INT0IF                        4506
#define T0IF                          4507
#define TMR0IF                        4508
#define RBIE                          4509
#define INT0E                         4510
#define INT0IE                        4511
#define T0IE                          4512
#define TMR0IE                        4513
#define PEIE                          4514
#define PEIE_GIEL                     4515
#define GIEL                          4516
#define GIE_GIEH                      4517
#define GIE                           4518
#define GIEH                          4519
#define STKPTR0                       4520
#define STKPTR                        4521
#define STKPTR1                       4522
#define STKPTR2                       4523
#define STKPTR3                       4524
#define STKPTR4                       4525
#define STKUNF                        4526
#define STKOVF                        4527
#define STKFUL                        4528

#endif // _PIC18F4680_H_
